function lab01_main
%=== Дисципліна:Основи обробки біомедичної інформації ===
%--- Лабораторна робота #1 Моделювання дискретних сигналів ---
%
% Використовуйте файли даних: 
% pec1.dat - сигнал ФКГ, ЕКГ та каротидного пульсу
%
% Функції користувача (m-файли), які необхідно розробити:
% pks = pksdetect(х) - знаходження піків в дискретному сигналі
%--------------------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #1')
disp('Моделювання дискретних сигналів')
disp('Виконав:Лимар Віталій, група БМ462 ІІДС') 

%=== Завдання #1.1 ===
% Моделювання одиничного імпульсу
N = 10;
n = 0:N-1;
x = double((n)==0);
y = double((n)==2);
class(x)
figure()
subplot( ), stem()
subplot(), stem()

%=== Завдання #1.2 === 
% Моделювання дискретного сигналу
N = 201;
n = ;
x = cos(pi*n/16);
figure()
subplot(), stem()
subplot(), plot()
subplot(), stairs()

%=== Завдання #1.3 ===
% Моделювання дискретної експоненти
n = ;
x1 = ;
x2 =;
x3 =;
x4 =;
figure()
subplot(), stem()
% продовжіть для сигналів х2, х3, х4
subplot(), stem()
subplot(), stem()
subplot(), stem()

%=== Завдання #1.4 - 1.6 ===
%?1.5
%?1.6
% Знаходження піків сигналу
fs = 1000;
t = 0:1/fs:2;
x = ;
pks = pksdetect();
figure()
plot(); hold on;
plot(); hold off;
xlabel(); ylabel();

%=== Завдання #2.1 - 2.2 ===
% Моделювання стохастичного сигналу
fs = 200; 
T = 1/fs; 
D = 0.25;
n = 0:1000;
r = randn(size(n))*sqrt(D);    % шум
s = ;        % сигнал
x = s + r;                     % сигнал+шум
figure()
plot()
title('Стохастичний сигнал')
xlabel(), ylabel()
fprintf('Математичне сподівання сигналу = %4.3g\n', mean(s))
fprintf('Дисперсія сигналу = %4.3g\n', var(s))
fprintf('Математичне сподівання шуму = %4.3g\n', mean(r))
fprintf('Дисперсія шуму = %4.3g\n', var(r))
fprintf('Математичне сподівання сигнал + шум = %4.3g\n', mean(x))
fprintf('Дисперсія сигнал + шум = %4.3g\n', var(x))

%=== Завдання #3.1 ===
% Зчитування відліків біосигналів з файлу pec1.dat 
% та побудова графіків сигналів
pec1 = load('pec1.dat');
fs = 1000;
fcg = pec1(:, 1); 
ecg = pec1(:, 2); 
cps = pec1(:, 3);
t = (0:length(fcg) - 1)/fs;
figure()
subplot(), plot(), xlim(), ylabel() 
title ()
subplot(), plot(), xlim(), ylabel()
subplot(), plot(), xlim(), ylabel()
xlabel()

